#include <iostream>
#include <string>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    string a1 = "", a2 = "", a3 = "", a4 = "", a5 = "", a6 = "", a7 = "", a8 = "";
    int N, r1 = 0, r2 = 0, r3 = 0, r4 = 0, r5 = 0, r6 = 0, r7 = 0, r8 = 0;
    while (1) {
        cout << "Введите натуральное число не превышающее 10000000: ";
        cin >> N;
        if (0 <= N && N <= 10000000) break;
        cout << "// значение некоректно //" << endl;
    }
    r1 = N % 10;
    r2 = N / 10 % 10;
    r3 = N / 100 % 10;
    r4 = N / 1000 % 10;
    r5 = N / 10000 % 10;
    r6 = N / 100000 % 10;
    r7 = N / 1000000 % 10;
    r8 = N / 10000000 % 10;
    if (r1 + r2 + r3 + r4 + r5 + r6 + r7 + r8 == 0){
        cout << "ноль";
        return 0;
    }
    if (r1 != 0 && r2 != 1) {
        if (r1 == 1) a1 = "один";
        if (r1 == 2) a1 = "два";
        if (r1 == 3) a1 = "три";
        if (r1 == 4) a1 = "четыре";
        if (r1 == 5) a1 = "пять";
        if (r1 == 6) a1 = "шесть";
        if (r1 == 7) a1 = "семь";
        if (r1 == 8) a1 = "восемь";
        if (r1 == 9) a1 = "девять";
    }
    if (r2 != 0 && r2 != 1) {
        if (r2 == 2) a2 = "двадцать ";
        if (r2 == 3) a2 = "тридцать ";
        if (r2 == 4) a2 = "сорок ";
        if (r2 == 5) a2 = "пятьдесять ";
        if (r2 == 6) a2 = "шестьдесят ";
        if (r2 == 7) a2 = "семьдесят ";
        if (r2 == 8) a2 = "восемьдесят ";
        if (r2 == 9) a2 = "девяносто ";
    }
    if (r2 == 1) {
        if (r1 == 1) a1 = "одиннадцать";
        if (r1 == 2) a1 = "двенадцать";
        if (r1 == 3) a1 = "тринадцать";
        if (r1 == 4) a1 = "четырнадцать";
        if (r1 == 5) a1 = "пятнадцать";
        if (r1 == 6) a1 = "шестнадцать";
        if (r1 == 7) a1 = "семнадцать";
        if (r1 == 8) a1 = "восемнадцать";
        if (r1 == 9) a1 = "девятнацать";
        if (r1 == 0) a2 = "десять";
    }
    if (r3 != 0) {
        if (r3 == 1) a3 = "сто ";
        if (r3 == 2) a3 = "двести ";
        if (r3 == 3) a3 = "триста ";
        if (r3 == 4) a3 = "четыреста ";
        if (r3 == 5) a3 = "пятьсот ";
        if (r3 == 6) a3 = "шестьсо т";
        if (r3 == 7) a3 = "семьсот ";
        if (r3 == 8) a3 = "восемьсот ";
        if (r3 == 9) a3 = "девятьсот ";
    }

    if (r4 != 0 && r5 != 1) {
        if (r4 == 1) a4 = "одна тысяча ";
        if (r4 == 2) a4 = "две тысячи ";
        if (r4 == 3) a4 = "три тысячи ";
        if (r4 == 4) a4 = "четыре тысячи ";
        if (r4 == 5) a4 = "пять тысяч ";
        if (r4 == 6) a4 = "шесть тысяч ";
        if (r4 == 7) a4 = "семь тысяч ";
        if (r4 == 8) a4 = "восемь тысяч ";
        if (r4 == 9) a4 = "девять тысяч ";
    }
    if (r5 != 0 && r5 != 1) {
        if (r5 == 2) a5 = "двадцать ";
        if (r5 == 3) a5 = "тридцать ";
        if (r5 == 4) a5 = "сорок ";
        if (r5 == 5) a5 = "пятьдесят ";
        if (r5 == 6) a5 = "шестьдесят ";
        if (r5 == 7) a5 = "семьдесят ";
        if (r5 == 8) a5 = "восемьдесят ";
        if (r5 == 9) a5 = "девяносто ";
        if (r7 == 0) a5 = a5 + "тысяч ";
    }
    if (r5 == 1) {
        if (r4 == 1) a4 = "одиннадцать тысяч ";
        if (r4 == 2) a4 = "двенадцать тысяч ";
        if (r4 == 3) a4 = "тринадцать тысяч ";
        if (r4 == 4) a4 = "четырнадцать тысяч ";
        if (r4 == 5) a4 = "пятнадцать тысяч ";
        if (r4 == 6) a4 = "шестнадцать тысяч ";
        if (r4 == 7) a4 = "семнадцать тысяч ";
        if (r4 == 8) a4 = "восемнадцать тысяч ";
        if (r4 == 9) a4 = "девятнацать тысяч ";
        if (r4 == 0) a5 = "десять тысяч ";
    }
    if (r6 != 0) {
        if (r6 == 1) a6 = "сто ";
        if (r6 == 2) a6 = "двести ";
        if (r6 == 3) a6 = "триста ";
        if (r6 == 4) a6 = "четыреста ";
        if (r6 == 5) a6 = "пятьсот ";
        if (r6 == 6) a6 = "шестьсо т";
        if (r6 == 7) a6 = "семьсот ";
        if (r6 == 8) a6 = "восемьсот ";
        if (r6 == 9) a6 = "девятьсот ";
    }
    if (r7 != 0 && r8 != 1) {
        if (r7 == 1) a7 = "один миллион ";
        if (r7 == 2) a7 = "два миллиона ";
        if (r7 == 3) a7 = "три миллиона ";
        if (r7 == 4) a7 = "четыре миллиона ";
        if (r7 == 5) a7 = "пять миллионов ";
        if (r7 == 6) a7 = "шесть миллионов ";
        if (r7 == 7) a7 = "семь миллионов ";
        if (r7 == 8) a7 = "восемь миллионов ";
        if (r7 == 9) a7 = "девять миллионов ";
    }
    /*if (r8 != 0 && r8 != 1) {
        if (r8 == 2) a8 = "двадцать ";
        if (r8 == 3) a8 = "тридцать ";
        if (r8 == 4) a8 = "сорок ";
        if (r8 == 5) a8 = "пятьдесят ";
        if (r8 == 6) a8 = "шестьдесят ";
        if (r8 == 7) a8 = "семьдесят ";
        if (r8 == 8) a8 = "восемьдесят ";
        if (r8 == 9) a8 = "девяносто ";
    }*/
    if (r8 == 1) a8 = "десять миллионов";
    cout << a8 + a7 + a6 + a5 + a4 + a3 + a2 + a1;
    return 0;
}